In [7]:
from sqlalchemy import create_engine, text
import pymysql
import pandas as pd

In [5]:
engine = create_engine("mysql+pymysql://bigdata:Bigdata123!!@localhost:3306/SampleDB")

In [6]:
conn = engine.connect()

In [18]:
df = pd.read_sql("select table_name from information_schema.tables where table_schema = 'SampleDB'",conn)

In [26]:
stmt = """
create table 복사_성적 as select * from 성적
"""
conn.execute(stmt)

In [31]:
stmt = """
select * 
 from information_schema.tables 
where table_schema = 'SampleDB'
  and table_name = '사원'
"""
df = pd.read_sql(stmt,conn)
df

Empty DataFrame
Columns: [TABLE_CATALOG, TABLE_SCHEMA, TABLE_NAME, TABLE_TYPE, ENGINE, VERSION, ROW_FORMAT, TABLE_ROWS, AVG_ROW_LENGTH, DATA_LENGTH, MAX_DATA_LENGTH, INDEX_LENGTH, DATA_FREE, AUTO_INCREMENT, CREATE_TIME, UPDATE_TIME, CHECK_TIME, TABLE_COLLATION, CHECKSUM, CREATE_OPTIONS, TABLE_COMMENT]
Index: []

[0 rows x 21 columns]

In [30]:
conn.execute(text("drop table 사원"))

In [32]:
stmt = """
create table 사원
(id int,
 name char(10)
)
"""
conn.execute(text(stmt))

In [33]:
qry = """
select table_name
 from information_schema.tables
where table_schema = 'SampleDB'
"""
pd.read_sql(qry,conn)

   table_name
0          고객
1        교수전공
2        기증내역
3        뉴스레터
4          대상
5         동아리
6        모의고사
7          물품
8       복사_성적
9        분기실적
10         사원
11       사원업무
12         상품
13         성적
14        성적2
15         소스
16         입고
17         전공
18         제품
19        졸작팀
20      줄넘기결과
21       지도교수
22          책
23      팀프로젝트
24         판매
25         학생
26       학생평가

In [21]:
stmt = """
select * from 줄넘기결과
"""
줄넘기결과 = pd.read_sql(stmt, conn)

In [22]:
stmt = """
create table 성적2 like 성적
"""
conn.execute(text(stmt))

In [23]:
stmt = """
insert into 성적2
select *
 from 성적
"""
conn.execute(text(stmt))

In [24]:
stmt = """
select *
 from 성적2
"""
df = pd.read_sql(stmt, conn)

In [25]:
df

           학번   이름 성별  반  점수
0   201501001  김수현  남  A  90
1   201501002  송혜교  여  A  75
2   201501003  하지원  여  A  77
3   201501004  장근석  남  A  85
4   201501005  이종석  남  A  95
5   201501006   주원  남  A  80
6   201501007  박보영  여  A  95
7   201501008  한효주  여  A  90
8   201501009  송중기  남  A  83
9   201501010  김우빈  남  A  88
10  201501011  이연희  여  B  75
11  201501012  유승호  남  B  84
12  201501013  박신혜  여  B  80
13  201501014  한지민  여  B  94
14  201501015  이승기  남  B  78
15  201501016  박민영  여  B  71
16  201501017  유아인  남  B  87
17  201501018  강소라  여  B  90
18  201501019  이민호  남  B  94
19  201501020  김태희  여  B  78

In [62]:
qry = """
select table_name,
       column_name,
       case when
        data_type = 'int'
       then
        data_type
       else
        concat(data_type, '(', character_maximum_length, ')') end as col
 from information_schema.columns
where table_schema = 'SampleDB'
  and table_name = '사원'
"""
pd.read_sql(qry,conn)

  table_name column_name       col
0         사원          id       int
1         사원        name  char(10)